000
100
120
150
1988
1989
1990
1991
1992
1994
1995
1996
1997
1998
1999
1st
200
2000
2001
2002
2003
2004
2005
2006
2007
2008
2009
2010
2011
2012
2013
2014
2015
2016
2017
2018
2nd
300
3402
3rd
400
4th
500
626
852
a_team
abil
abl
about
abov
academ
acca
accept
access
accommod
accomplish
accord
account
account_open
accounting_fin
accounting_system
accret
accrual
accur
accuraci
achiev
acquir
acquisit
act
action
activ
actual
acumen
ad_hoc
adapt
add
addit
additional_inform
address
adequ
adher
adjust
adm
admin
administr
adob
adobe_photoshop
adopt
adv
advanc
advertis
advic
advis
advisor
advisori
advoc
affair
affili
africa
age
agenc
agent
agre
agreement
agricultur
aid
aim
air
airlin
airport
align
all
allianc
alloc
allow
alongsid
alpha
also
altern
ambassador
amend
america
american
aml
amount
analys
analysi
analyst
analyt
analyz
and
angel
anglo
ani
announc
annual
answer
anti
apac
app
appli
applic
appoint
apprais
appreci
approach
appropri
approv
approxim
apr
april
aptitud
arbitr
are
area
aris
arm
armed_forc
arrang
art
articl
ascertain
asean
asia
asia_pacif
asian
aspect
aspir
assess
asset
asset_manag
assign
assist
assistant_manag
associ
assur
attach
attain
attempt
attend
attent
attitud
attorney
attract
attribut
audit
audit_assur
audit_engag
auditor
aug
august
aum
australia
australian
author
autom
avail
ave
avenu
averag
aviat
awar
award
bachelor
bachelor_busi
bachelor_commerc
bachelor_sci
back
background
backpack
badminton
bahasa
bahrain
balanc
balance_sheet
band
bank
banker
banking_fin
barclay
bas
base
basi
basic
basketbal
battalion
bay
bba
been
behalf
beij
benchmark
beneficiari
benefit
berhad
best
better
beverag
bid
big
bill
billion
biolog
birth
blk
block
bloomberg
bloomberg_termin
bnp
board
bodi
bond
bonu
book
bookkeep
boost
bord
borrow
both
bottom
bowl
box
branch
brand
break
brief
bring
british
broad
broadcast
broker
brokerag
bronz
brook
bsc
budget
budget_forecast
build
built
bukit
busi
business_administr
business_develop
business_school
buy
buyer
cadet
calcul
california
call
cambridg
camp
campaign
campu
canada
canadian
candid
cantones
cantonese_n
cap
capabl
capac
capit
capital_market
captain
captur
card
care
career
carri
case
cash
cash_flow
cashflow
categori
cathol
cayman
cca
cell
cellular
cement
center
centr
central
ceo
certif
certifi
certified_publ
cfa
cfa_institut
cfa_level
cfo
cft
cgpa
chain
chairman
challeng
chamber
champion
championship
chan
chang
channel
chapter
charg
chariti
chart
charter
chartered_account
chase
check
chee
chemic
chemistri
chen
cheng
chequ
chief
children
china
chines
choir
chong
chung
circular
citco_fund
citi
citibank
citizen
city_univers
civil
claim
class
class_honour
clean
clear
cleric
client
close
closur
cloud
club
cmfa
coach
coal
code
cohort
collabor
collater
colleagu
collect
colleg
columbia
combin
command
commend
comment
commentari
commerc
commerci
commiss
commit
committe
commod
common
commun
communication_skil
comp
compani
company
company_secretari
compar
comparison
compens
compet
competit
competitor
compil
complaint
complet
complex
compli
complianc
compliant
compon
comprehens
compris
comput
computer_skil
concentr
concept
concern
conclus
concurr
condit
conduct
confer
confid
confidenti
confirm
conflict
conglomer
connect
consider
consist
consolid
consortium
constraint
construct
consult
consum
contact
content
contest
context
continu
contract
contribut
control
convent
convers
convert
cook
cooper
coordin
core
corp
corpor
corporate_act
corporate_fin
corporate_govern
corporate_secretari
correct
correctli
correspond
cost
council
counsel
counterparti
countri
cours
coursework
court
coven
cover
coverag
cpa
cpa_australia
cpf
creat
creation
creativ
credit
credit_suiss
creditor
crew
criteria
critic
cross
cross_bord
cultiv
cultur
cum
cumul
currenc
current
curricular
curriculum
custodi
custodian
custom
cut
cycl
daili
danc
data
databas
date
date_birth
day
dcf
deadlin
deal
dealer
dean
dean_list
debat
debt
debtor
dec
decemb
decid
decis
deed
deep
default
defend
defici
defin
degre
deleg
deliv
deliver
deliveri
deloitt
deloitte_touch
demand
demonstr
depart
department
deploy
deposit
dept
depth
deputi
deriv
design
desk
detail
determin
deutsch
develop
differ
differenti
digit
dilig
dinner
diploma
direct
directli
director
disciplin
disclosur
discount
discrep
discretionari
discuss
display
dispos
disput
dissemin
distinct
distress
distribut
distributor
district
div
dive
divers
diversifi
divest
dividend
divis
document
dollar
domest
donat
doubl
down
draft
dragon
drawdown
dreamweav
drive
driven
driver
dual
dubai_ua
due
due_dilig
duti
dynam
e_r
each
eagl
earli
earn
east
eastern
ebitda
econom
economi
edit
educ
effect
effici
effort
eikon
elect
electr
electron
email
emea
emerg
employ
employe
enabl
end
end_clos
energi
enforc
engag
engin
england
english
english_flu
english_mandarin
enhanc
enjoy
enquiri
enrich
ensur
enter
enterpris
enthusiast
entir
entiti
entrepreneur
entri
environ
environment
equal
equip
equiti
equity_research
ernst_young
erp
error
escal
establish
estat
estim
etc
etf
ethic
europ
european
evalu
event
evid
exam
examin
exceed
excel
excel_powerpoint
excel_word
except
excess
exchang
exchange_program
execut
exempt
exercis
exhibit
exist
exit
expand
expans
expect
expected_salari
expens
experi
experienc
expert
expertis
explain
explor
export
expos
exposur
express
extend
extens
extern
external_auditor
extra
extract
face
facil
facilit
factor
factset
faculti
fair
fall
famili
familiar
family_offic
fashion
fast
fatca
feasibl
featur
feb
februari
fee
feedback
fellow
femal
festiv
field
fieldwork
figur
file
fill
fin
final
finalist
financ
financi
financial_analysi
financial_analyst
financial_institut
financial_model
financial_report
financial_servic
financial_stat
find
firm
first
fit
five
fix
fixed_incom
flagship
flash
flat
flexibl
flight
flow
fluent
fluent_english
fmcg
focu
focus
follow
food
for
forecast
foreign
forens
form
format
formul
fortun
forum
forward
foster
found
foundat
founder
four
framework
franc
franchis
fraud
french
frequent
freshmen
frm
from
front
frr
fulfil
full
full_set
fulli
function
fund
fund_account
fund_manag
fund_servic
fundament
fundrais
further
futur
gaap
gain
game
gap
garden
gather
gave
gce
gce_level
gcse
gem
gender
gener
general_ledg
geneva
geographi
german
germani
get
girl
give
global
gmail
goal
gold
golden
goldman_sach
golf
good
govern
gpa
grade
graduat
grant
great
greater_china
green
grew
ground
group
grow
growth
gst
guarante
guest
guid
guidanc
guidelin
had
hall
hand
handl
hangzhou
have
head
headquart
health
healthcar
hedg
hedge_fund
held
help
high
high_school
higher
highest
highli
highlight
hire
histor
histori
hkfr
hkicpa
hkma
hkust
hnw
hobbi
hoc
hokkien
hold
holder
holist
home
hon
hone
hong
hong_kong
honor
honour
hospit
host
hotel
hotmail
hour
hous
hsbc
http
human
human_resourc
i_n
ial
ibm
ice
ide
idea
identif
identifi
ielt
iew
ifr
iii
ile
ill
ima
immedi
impact
impair
imperi
implement
import
improv
inanc
inanci
inat
incent
includ
incom
incorpor
increas
independ
index
india
indian
indic
individu
indonesia
indonesian
industri
inform
infrastructur
ing
ingapor
inistr
initi
inland_revenu
innov
input
inquiri
insight
institut
institute_certifi
institutional_investor
instruct
instrument
insur
integr
intellectu
intellig
intens
inter
interact
interest
interest_r
interfac
interim
intermedi
intermediari
intern
internal_control
internal_extern
internet
internship
interperson
interpret
interview
introduc
introduct
inventori
invesco
invest
investig
investment_bank
investor
investor_rel
invit
invoic
involv
ion
ional
ipo
irr
isa
isca
isda
island
issu
issuanc
ite
item
ith
iti
ive
jalan
jame
jan
januari
japan
japanes
java
job
jog
john
join
joint
joint_ventur
journal
journal_entri
jul
juli
jun
june
junior
junior_colleg
jurisdict
jurong
keen
keep
key
kind
king
knowledg
kong
korea
korean
kowloon
kpi
kpmg
kyc
land
landscap
languag
languages_english
larg
largest
latest
laud
launch
launder
law
lawyer
lbo
lead
leader
leadership
learn
learner
learnt
leas
leav
lectur
led
ledg
ledger
lee
legal
legisl
lend
letter
level
leverag
liabil
liais
liaison
licenc
licens
life
lim
limit
lin
line
ling
link
linkedin
liquid
list
listed_compani
listen
litig
liu
live
llc
llp
loan
local
locat
logist
london
long
look
loss
lotu
low
lower
ltd
macau
macro
macroeconom
made
mail
main
mainland
maintain
mainten
major
mak
make
maker
malay
malaysia
malaysian
man
manag
manageri
managing_director
mandarin
mandat
mandatori
manner
manual
manufactur
mar
marathon
march
margin
marin
marina
marital_statu
maritim
mark
market
marketing_materi
master
match
materi
math
mathemat
matlab
matrix
matter
maxim
may
maybank
mba
measur
mechan
media
medic
medium
meet
melbourn
mellon
member
membership
memo
memorandum
memori
men
mentor
mentorship
merchant
merger
merit
merrill_lynch
met
method
methodolog
meticul
metric
mezzanin
microsoft
microsoft_excel
microsoft_offic
mid
middl
middle_east
migrat
million
mind
mine
ming
minim
ministri
minor
minut
mission
mitig
mnc
mobil
model
modul
monetary_author
money
monitor
month
month_notic
monthli
more
morgan
morgan_stanley
morningstar
mortgag
most
motiv
move
movement
movi
mpf
ms_offic
ms_word
msc
much
multi
multin
multipl
mumbai
music
mutual
myanmar
myob
name
nanyang
nanyang_technolog
nation
nationality_singaporean
nativ
natur
nav
necessari
need
negoti
net
net_asset
net_worth
netherland
network
new
new_york
newli
news
ngee_ann
night
non
north
not
notabl
note
notic
nov
novemb
nric
ntu
number
numer
o_n
object
oblig
obtain
ocbc
occur
oct
octob
off
offer
offic
office_word
offici
offshor
oil
oil_ga
onboard
one
ongo
onli
onlin
onshor
ontario
open
oper
opinion
opportun
optim
option
oracl
oral
order
ordin
ordinari
org
organ
organis
organiz
ori
orient
origin
otc
other
our
out
outgo
outlook
outreach
outsourc
outstand
over
overal
oversaw
overse
oversea
oversight
own
owner
ownership
oxford
pac
pacif
pack
packag
page
paid
pair
panel
paper
pari
pariba
park
part
parti
particip
particular
partner
partnership
pass
passion
past
pay
payabl
payment
payrol
peer
pension
peopl
percentil
perform
period
perman
person
personnel
perspect
pharmaceut
phase
philippin
phone
photographi
physic
piano
pick
ping
pitch
pivot
place
placement
plan
plant
platform
play
player
point
poland
polici
policies_procedur
polit
polytechn
port
portfolio
posit
possess
possibl
post
potenti
power
powerpoint
practic
prc
pre
preced
predict
prefer
prepar
present
presid
pressur
prestigi
previou
previous
price
pricewaterhousecoop
primari
prime
prime_brok
princip
principl
prior
priorit
privat
private_equ
prize
pro
proactiv
problem
problem_solv
procedur
proceed
process
procur
produc
product
profession
professional_experi
professional_qualif
profici
proficient_microsoft
profil
profit
profit_loss
program
programm
progress
project
promot
proof
proper
properti
propos
proprietari
prospect
prospectu
protect
proven
provid
provis
prudenti
psycholog
pte
public
public_account
publish
purchas
purpos
pursu
pursuant
put
putonghua
pwc
qualif
qualifi
qualit
qualiti
quantit
quarter
quarterli
queensland
queri
question
questionnair
quick
quickbook
quotat
race
rais
rang
rank
rat
rate
ratio
reach
read
real
real_est
reason
receipt
receiv
recent
recept
recipi
recognit
recommend
reconcil
reconcili
record
recruit
red
redempt
reduc
reduct
refer
refere
referr
regard
region
regist
registr
regul
regular
regularli
regulatori
regulatory_requir
reit
rel
relat
relationship
releas
relev
reliabl
remitt
renew
reorganis
replac
report
repres
republ
reput
request
requir
research
research_analyst
reserv
resid
residenti
resolut
resolv
resourc
respect
respond
respons
restaur
restructur
result
resum
retail
return
reuter
rev
revenu
review
rfp
right
risk
risk_manag
rmb
road
roadshow
robust
role
roll
room
round
royal
rqfii
rule
run
runner
safeti
salari
sale
sampl
san
sap
satisfact
saudi
save
scale
scenario
schedul
scheme
scholar
scholarship
school
scienc
scope
score
screen
search
season
sec
second
secondari
secondary_school
secretari
section
sector
secur
securities_futur
seek
segment
select
self
sell
semest
semi
seminar
senior
senior_associ
senior_manag
sens
sensit
sep
separ
sept
septemb
seri
serv
servic
service_provid
session
set
settlement
setup
sever
sfc
sgd
sgx
shanghai
share
sharehold
sheet
shenzhen
ship
shop
short
show
sid
side
sign
signific
silver
sim
sing
singapor
singapore
singapore_pt
singaporean
singl
sit
site
situat
six
size
skill
skillset
slide
small
smooth
social
societi
soft
softwar
sole
solicit
solicitor
solid
solut
solv
some
sound
sourc
south
south_east
south_wal
southeast
sovereign
sovereign_wealth
sox
space
span
spanish
speak
speaker
spearhead
special
specialis
specialist
specif
spectrum
spoken
spoken_written
sponsor
sponsorship
sport
spot
spreadsheet
spring
spss
spv
sql
staff
stage
stake
stakehold
stand
standard
standard_chart
stapl
start
startup
state
statement
statist
statu
statutori
steel
step
stock
stock_exchang
storag
store
stori
strateg
strategi
stream
streamlin
street
strength
strengthen
strict
strong
structur
student
studi
sub
subject
submiss
submit
subordin
subscript
subscription_redempt
subsequ
subsidiari
substant
succeed
success
suffici
suggest
suit
suitabl
summari
summer
summer_intern
sun
superior
supervis
supervisor
suppli
supplier
support
survey
sustain
swap
swift
swim
swiss
switch
sydney
syndic
synergi
system
tabl
tai
tailor
taiwan
take
takeov
talent
tan
tank
target
task
taught
tax
tax_return
taxat
teach
team
team_memb
team_play
teamwork
technic
technician
techniqu
technolog
tel
telecom
telecommun
telephon
temasek
temp
templat
ten
tender
tenni
ter
term
termin
territori
test
thai
thailand
than
that
the
their
them
themat
theori
these
thesi
they
thi
think
third
thomson_reut
three
tier
tight
tight_deadlin
tim
time
timelin
timely_mann
ting
titl
tmt
to_day
tokyo
tool
top
topic
toronto
total
tour
tourism
tournament
tower
trace
track
trade
trader
tradit
train
traine
transact
transfer
transform
transit
translat
transport
travel
treasuri
treatment
trend
trial
trip
trust
truste
turnaround
turnov
tutor
two
type
uae
uat
uhnw
under
undergradu
underli
understand
undertak
undertook
union
uniqu
unit
united_kingdom
united_st
univers
university_hong
upcom
updat
upgrad
upon
upper
upstream
us_gaap
usa
usag
usd
use
user
util
utilis
valid
valu
valuabl
valuat
vari
varianc
variance_analysi
varieti
variou
vba
vehicl
vendor
ventur
verbal
verif
verifi
vessel
vice
vice_presid
vietnam
view
visit
visual
vita
volum
volunt
voluntari
vouch
voucher
wai
wale
walk
wan
warehous
washington
watch
water
way
weak
wealth
wealth_manag
websit
week
weekli
wei
welfar
well
west
which
whilst
